.include "tn2313def.inc"


.equ	const3	=987*7.5679					;7469. Умножение с дробной, в результате без дробной
		ldi		R17,high(const3)			;загрузили в резистр 74
		ldi		R18,low(const3)				;загрузили в резистр 69

		ldi		R19,byte1(0x12345678)		;В регистр загружен байт 78
		ldi		R20,byte2(0x12345678)		;В регистр загружен байт 56
		ldi		R21,byte3(0x12345678)		;В регистр загружен байт 34
		ldi		R22,byte4(0x12345678)		;В регистр загружен байт 12
//		ldi		R23,byte5(0x12345678)		;В регистр загружен байт 00


		ldi		R23,'A'
